import { useTranslations } from 'next-intl'
import s from './terms.module.scss'
import GoHome from '@/shared/ui/goHome/goHome'
const Terms = () => {
  const t = useTranslations('home')
  return (
    <>
      <main className={s.container}>
        <h1 className={s.title}>{t('terms.title')}</h1>
        <article className={s.text}>
          Настоящая Политика конфиденциальности персональной информации (далее —
          Политика) действует в отношении всей информации, которую Бурдасов
          Наиль Анатольевич (адрес регистрации: 414000 Астраханская область, г.
          Астрахань, ул. Куприна, 25) и/или его аффилированные лица, могут
          получить о пользователе во время использования им сайта
          http://bsgroup.io/.
          <br /> <br /> Использование сайта http://bsgroup.io/ означает
          безоговорочное согласие пользователя с настоящей Политикой и
          указанными в ней условиями обработки его персональной информации; в
          случае несогласия с этими условиями пользователь должен воздержаться
          от использования данного ресурса. <br /> <br />
          1. Персональная информация пользователей, которую получает и
          обрабатывает сайт http://bsgroup.io/
          <br />
          1.1. В рамках настоящей Политики под «персональной информацией
          пользователя» понимаются: <br /> 1.1.1. Персональная информация,
          которую пользователь предоставляет о себе самостоятельно при
          оставлении заявки, совершении покупки, регистрации (создании учётной
          записи) или в ином процессе использования сайта. <br /> 1.1.2 Данные,
          которые автоматически передаются сайтом http://bsgroup.io/ в процессе
          его использования с помощью установленного на устройстве пользователя
          программного обеспечения, в том числе IP-адрес, информация из cookie,
          информация о браузере пользователя (или иной программе, с помощью
          которой осуществляется доступ к сайту), время доступа, адрес
          запрашиваемой страницы. <br /> 1.1.3. Данные, которые предоставляются
          сайту, в целях осуществления оказания услуг и/или продаже товара и/или
          предоставления иных ценностей для посетителей сайта, в соответствии с
          деятельностью настоящего ресурса: имя пользователя, адрес электронной
          почты , номер телефона. <br /> 1.2. Настоящая Политика применима
          только к сайту http://bsgroup.io/ и не контролирует и не несет
          ответственность за сайты третьих лиц, на которые пользователь может
          перейти по ссылкам, доступным на сайте http://bsgroup.io/. На таких
          сайтах у пользователя может собираться или запрашиваться иная
          персональная информация, а также могут совершаться иные действия.{' '}
          <br />
          1.3. Сайт в общем случае не проверяет достоверность персональной
          информации, предоставляемой пользователями, и не осуществляет контроль
          за их дееспособностью. Однако сайт http://bsgroup.io/ исходит из того,
          что пользователь предоставляет достоверную и достаточную персональную
          информацию по вопросам, предлагаемым в формах настоящего ресурса, и
          поддерживает эту информацию в актуальном состоянии. <br />
          <br />
          2. Цели сбора и обработки персональной информации пользователей <br />
          2.1. Сайт собирает и хранит только те персональные данные, которые
          необходимы для оказания услуг и/или продаже товара и/или
          предоставления иных ценностей для посетителей сайта
          http://bsgroup.io/. <br />
          2.2. Персональную информацию пользователя можно использовать в
          следующих целях: <br />
          2.2.1 Предоставление пользователю персонализированных услуг и
          сервисов, товаров и иных ценностей <br /> <br />
          3. Условия обработки персональной информации пользователя и её
          передачи третьим лицам <br />
          3.1. Сайт http://bsgroup.io/ хранит персональную информацию
          пользователей в соответствии с внутренними регламентами конкретных
          сервисов. <br /> 3.2. В отношении персональной информации пользователя
          сохраняется ее конфиденциальность, кроме случаев добровольного
          предоставления пользователем информации о себе для общего доступа
          неограниченному кругу лиц. <br /> 3.3. Сайт http://bsgroup.io/ вправе
          передать персональную информацию пользователя третьим лицам в
          следующих случаях: <br /> 3.3.1. Пользователь выразил свое согласие на
          такие действия, путем согласия выразившегося в предоставлении таких
          данных; <br /> 3.3.2. Передача необходима в рамках использования
          пользователем определенного сайта http://bsgroup.io/, либо для
          предоставления товаров и/или оказания услуги пользователю;
          <br /> 3.3.3. Передача предусмотрена российским или иным применимым
          законодательством в рамках установленной законодательством процедуры;
          <br /> 3.3.4. В целях обеспечения возможности защиты прав и законных
          интересов сайта http://bsgroup.io/ или третьих лиц в случаях, когда
          пользователь нарушает Пользовательское соглашение сайта
          http://bsgroup.io/. <br /> 3.4. При обработке персональных данных
          пользователей сайт http://bsgroup.io/ руководствуется Федеральным
          законом РФ «О персональных данных». <br /> <br /> 4. Изменение
          пользователем персональной информации <br /> 4.1. Пользователь может в
          любой момент изменить (обновить, дополнить) предоставленную им
          персональную информацию или её часть, а также параметры её
          конфиденциальности, оставив заявление в адрес администрации сайта
          следующим способом: Email: nnaaiillburdasov@gmail.com <br /> 4.2.
          Пользователь может в любой момент, отозвать свое согласие на обработку
          персональных данных, оставив заявление в адрес администрации сайта
          следующим способом: Email: nnaaiillburdasov@gmail.com <br /> <br /> 5.
          Меры, применяемые для защиты персональной информации пользователей
          Сайт принимает необходимые и достаточные организационные и технические
          меры для защиты персональной информации пользователя от неправомерного
          или случайного доступа, уничтожения, изменения, блокирования,
          копирования, распространения, а также от иных неправомерных действий с
          ней третьих лиц.
          <br /> <br /> 6. Изменение Политики конфиденциальности. Применимое
          законодательство <br /> 6.1. Сайт имеет право вносить изменения в
          настоящую Политику конфиденциальности. При внесении изменений в
          актуальной редакции указывается дата последнего обновления. Новая
          редакция Политики вступает в силу с момента ее размещения, если иное
          не предусмотрено новой редакцией Политики. <br /> 6.2. К настоящей
          Политике и отношениям между пользователем и Сайтом, возникающим в
          связи с применением Политики конфиденциальности, подлежит применению
          право Российской Федерации. <br /> <br />
          7. Обратная связь. Вопросы и предложения <br /> 7.1. Все предложения
          или вопросы по поводу настоящей Политики следует направлять следующим
          способом: Email: nnaaiillburdasov@gmail.com
        </article>
        <GoHome />
      </main>
    </>
  )
}

export default Terms
